DATETIME_F = "%Y-%m-%d %H:%M:%S"

SYMBOLS = {
    "in_progress": "⬤",
    "done": "✔",
    "cancelled": "✖",
}

SQL_UPDATEDATA = "UPDATE patientinfo SET " \
                 "room = ?," \
                 "oak_status = ?," \
                 "oak_time = ?," \
                 "oak_follow = ?," \
                 "bak_status = ?," \
                 "bak_time = ?," \
                 "bak_follow = ?," \
                 "trp_status = ?," \
                 "trp_time = ?," \
                 "trp_follow = ?," \
                 "ddm_status = ?," \
                 "ddm_time = ?," \
                 "ddm_follow = ?," \
                 "glu_status = ?," \
                 "glu_time = ?," \
                 "glu_follow = ?," \
                 "oam_status = ?," \
                 "oam_time = ?," \
                 "oam_follow = ?," \
                 "dia_status = ?," \
                 "dia_time = ?," \
                 "dia_follow = ?," \
                 "acb_status = ?," \
                 "acb_time = ?," \
                 "acb_follow = ?," \
                 "bnp_status = ?," \
                 "bnp_time = ?," \
                 "bnp_follow = ?," \
                 "psp_status = ?," \
                 "psp_time = ?," \
                 "psp_follow = ?," \
                 "agc_status = ?," \
                 "agc_time = ?," \
                 "agc_follow = ?," \
                 "abc_status = ?," \
                 "abc_time = ?," \
                 "abc_follow = ?," \
                 "xra_status = ?," \
                 "xra_follow = ?," \
                 "xra_time = ?," \
                 "cts_status = ?," \
                 "cts_time = ?," \
                 "cts_follow = ?," \
                 "usd_status = ?," \
                 "usd_time = ?," \
                 "usd_follow = ?," \
                 "end_status = ?," \
                 "end_time = ?," \
                 "end_follow = ?," \
                 "neur_status = ?," \
                 "neur_time = ?," \
                 "neur_follow = ?," \
                 "card_status = ?," \
                 "card_time = ?," \
                 "card_follow = ?," \
                 "rean_status = ?," \
                 "rean_time = ?," \
                 "rean_follow = ?," \
                 "surg_status = ?," \
                 "surg_time = ?," \
                 "surg_follow = ?," \
                 "urol_status = ?," \
                 "urol_time = ?," \
                 "urol_follow = ?," \
                 "proc_status = ?," \
                 "proc_time = ?," \
                 "proc_follow = ? " \
                 "WHERE patient_id = ?"

SQL_INSERTDATA = "INSERT INTO patientinfo VALUES (" \
                 "?," \
                 "?," \
                 "?," \
                 "?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?, ?, ?," \
                 "?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?,?," \
                 "?)"

TV_HEADERS = {
    0: ("", 0, 0, "patient_id"),
    1: ("ФИО пациента", 210, 1, "name"),
    2: ("", 20, 1, "room"),
    3: ("Время", 115, 1, "time"),
    4: ("ОАК", 40, 2, "oak_status"),
    5: ("", 0, 0, "oak_time"),
    6: ("", 0, 0, "oak_follow"),
    7: ("БАК", 40, 2, "bak_status"),
    8: ("", 0, 0, "bak_time"),
    9: ("", 0, 0, "bak_follow"),
    10: ("ТnI", 40, 2, "trp_status"),
    11: ("", 0, 0, "trp_time"),
    12: ("", 0, 0, "trp_follow"),
    13: ("Ддм", 40, 2, "ddm_status"),
    14: ("", 0, 0, "ddm_time"),
    15: ("", 0, 0, "ddm_follow"),
    16: ("Glu", 40, 2, "glu_status"),
    17: ("", 0, 0, "glu_time"),
    18: ("", 0, 0, "glu_follow"),
    19: ("ОАМ", 40, 2, "oam_status"),
    20: ("", 0, 0, "oam_time"),
    21: ("", 0, 0, "oam_follow"),
    22: ("Диа", 40, 2, "dia_status"),
    23: ("", 0, 0, "dia_time"),
    24: ("", 0, 0, "dia_follow"),
    25: ("КЩС", 40, 2, "acb_status"),
    26: ("", 0, 0, "acb_time"),
    27: ("", 0, 0, "acb_follow"),
    28: ("BNP", 40, 2, "bnp_status"),
    29: ("", 0, 0, "bnp_time"),
    30: ("", 0, 0, "bnp_follow"),
    31: ("Псп", 40, 2, "psp_status"),
    32: ("", 0, 0, "psp_time"),
    33: ("", 0, 0, "psp_follow"),
    34: ("Ag", 40, 2, "agc_status"),
    35: ("", 0, 0, "agc_time"),
    36: ("", 0, 0, "agc_follow"),
    37: ("Ab", 40, 2, "abc_status"),
    38: ("", 0, 0, "abc_time"),
    39: ("", 5, 1, "abc_follow"),  # also a separator
    40: ("Rгр", 40, 2, "xra_status"),
    41: ("", 0, 0, "xra_follow"),
    42: ("", 0, 0, "xra_time"),
    43: ("КТ", 40, 2, "cts_status"),
    44: ("", 0, 0, "cts_time"),
    45: ("", 0, 0, "cts_follow"),
    46: ("УЗИ", 40, 2, "usd_status"),
    47: ("", 0, 0, "usd_time"),
    48: ("", 0, 0, "usd_follow"),
    49: ("ФГДС", 50, 2, "end_status"),
    50: ("", 0, 0, "end_time"),
    51: ("", 0, 0, "end_follow"),
    52: ("невр", 50, 2, "neur_status"),
    53: ("", 0, 0, "neur_time"),
    54: ("", 0, 0, "neur_follow"),
    55: ("кард", 50, 2, "card_status"),
    56: ("", 0, 0, "card_time"),
    57: ("", 0, 0, "card_follow"),
    58: ("реан", 50, 2, "rean_status"),
    59: ("", 0, 0, "rean_time"),
    60: ("", 0, 0, "rean_follow"),
    61: ("хир", 50, 2, "surg_status"),
    62: ("", 0, 0, "surg_time"),
    63: ("", 0, 0, "surg_follow"),
    64: ("урол", 50, 2, "urol_status"),
    65: ("", 0, 0, "urol_time"),
    66: ("", 0, 0, "urol_follow"),
    67: ("прок", 50, 2, "proc_status"),
    68: ("", 0, 0, "proc_time"),
    69: ("", 0, 0, "proc_follow"),
    70: ("", 0, 0, "birthdate"),  # дата рождения
}

NAMES = [
    "Акимова Василиса Михайловна",
    "Аксенова Елизавета Александровна",
    "Александрова София Георгиевна",
    "Алексеева Дарья Ярославовна",
    "Антипова Полина Романовна",
    "Антонова Нина Ивановна",
    "Антонова Ирина Фёдоровна",
    "Антонова Елизавета Максимовна",
    "Астафьева Маргарита Михайловна",
    "Афанасьева Алина Матвеевна",
    "Безрукова Ольга Тимофеевна",
    "Белова Марина Григорьевна",
    "Березина Василиса Марковна",
    "Бессонова Мирослава Романовна",
    "Бирюкова Анастасия Мироновна",
    "Боброва Диана Данииловна",
    "Боброва Алиса Ивановна",
    "Богданова Екатерина Всеволодовна",
    "Богомолова София Максимовна",
    "Борисова Маргарита Ивановна",
    "Бородина Маргарита Леоновна",
    "Бурова Вероника Владимировна",
    "Быкова Варвара Гордеевна",
    "Васильева Мария Владимировна",
    "Верещагина Полина Леонидовна",
    "Вешнякова Ольга Алексеевна",
    "Виноградова Полина Платоновна",
    "Виноградова София Мироновна",
    "Волкова Милена Максимовна",
    "Воробьева София Тимофеевна",
    "Воробьева Ника Артёмовна",
    "Воробьева Елизавета Максимовна",
    "Воробьева Екатерина Всеволодовна",
    "Воронина Анна Максимовна",
    "Воронцова Анна Дмитриевна",
    "Высоцкая Полина Данииловна",
    "Глухова Светлана Константиновна",
    "Голикова Ангелина Богдановна",
    "Головина Ева Никитична",
    "Головина Ксения Егоровна",
    "Голубева Яна Максимовна",
    "Гончарова Анастасия Викторовна",
    "Горелова Милана Тихоновна",
    "Давыдова Алина Георгиевна",
    "Данилова Варвара Максимовна",
    "Дементьева Лилия Львовна",
    "Демидова Алиса Савельевна",
    "Денисова Алиса Артёмовна",
    "Дмитриева Мария Тимуровна",
    "Дмитриева Ольга Кирилловна",
    "Дьякова Мария Арсеньевна",
    "Евдокимова Анастасия Данииловна",
    "Егорова Варвара Ильинична",
    "Егорова Яна Данииловна",
    "Ермилова Полина Николаевна",
    "Ермолаева Дарья Ярославовна",
    "Ерофеева Ольга Данииловна",
    "Ершова Майя Фёдоровна",
    "Жданова Полина Арсеньевна",
    "Журавлева Алиса Александровна",
    "Зайцева Александра Родионовна",
    "Зайцева Екатерина Артёмовна",
    "Зайцева Вероника Артемьевна",
    "Зубкова Ника Александровна",
    "Иванова Ксения Германовна",
    "Иванова Ульяна Константиновна",
    "Иванова София Артёмовна",
    "Исакова Дарья Вячеславовна",
    "Казакова Маргарита Степановна",
    "Казакова Арина Ильинична",
    "Калмыкова Екатерина Артуровна",
    "Карпова Вероника Михайловна",
    "Карташова Диана Романовна",
    "Колесова Анна Владимировна",
    "Колосова София Александровна",
    "Колпакова Полина Ильинична",
    "Комарова Екатерина Максимовна",
    "Кондратьева Анна Артемьевна",
    "Кондрашова Мария Данииловна",
    "Коновалова Анастасия Владимировна",
    "Кононова София Тимофеевна",
    "Корнеева Анна Михайловна",
    "Корнеева Полина Анатольевна",
    "Коровина Дарья Дмитриевна",
    "Королева Анастасия Денисовна",
    "Королева Арина Артёмовна",
    "Короткова Елизавета Степановна",
    "Короткова Анна Матвеевна",
    "Крылова Ева Ивановна",
    "Крюкова Анна Романовна",
    "Крючкова Александра Львовна",
    "Кузина Валерия Егоровна",
    "Кузина Ульяна Михайловна",
    "Кузина Марина Данииловна",
    "Кузнецова Елизавета Марковна",
    "Кузнецова Анна Львовна",
    "Кузнецова Милана Гордеевна",
    "Кузнецова Мария Данииловна",
    "Кузнецова Валерия Владимировна",
    "Кузнецова София Гордеевна",
    "Лазарева Евгения Владимировна",
    "Лапина Анна Михайловна",
    "Лаптева Алёна Андреевна",
    "Ларионова Арина Данииловна",
    "Лебедева Дарья Георгиевна",
    "Левина Кристина Данииловна",
    "Лукина Анна Данииловна",
    "Лыкова Варвара Ивановна",
    "Любимова Ксения Андреевна",
    "Майорова Виктория Матвеевна",
    "Макарова Анна Михайловна",
    "Мартынова Алиса Алексеевна",
    "Масленникова Василиса Никитична",
    "Медведева Мария Егоровна",
    "Морозова Валерия Артёмовна",
    "Морозова Виктория Михайловна",
    "Назарова Дарья Ивановна",
    "Наумова Елизавета Дмитриевна",
    "Никитина Нина Тимофеевна",
    "Николаева Арина Михайловна",
    "Николаева София Никитична",
    "Николаева Мария Максимовна",
    "Николаева Валерия Данииловна",
    "Николаева Анастасия Никитична",
    "Новикова Ангелина Данииловна",
    "Новикова София Ильинична",
    "Новикова Мария Тимофеевна",
    "Озерова Милана Вадимовна",
    "Окулова Анастасия Глебовна",
    "Орлова Надежда Николаевна",
    "Осипова Екатерина Владимировна",
    "Островская Кира Матвеевна",
    "Павловская Алиса Александровна",
    "Панова Мария Захаровна",
    "Панова Алиса Ильинична",
    "Парфенова Алёна Павловна",
    "Петрова Анна Владиславовна",
    "Петрова Александра Антоновна",
    "Петрова Василиса Михайловна",
    "Петровская Ксения Ильинична",
    "Полякова Варвара Филиповна",
    "Попова Ульяна Кирилловна",
    "Попова Полина Фёдоровна",
    "Попова Арина Дмитриевна",
    "Постникова Виктория Андреевна",
    "Ракова Мария Данииловна",
    "Рогова Ольга Тимофеевна",
    "Родина Анастасия Олеговна",
    "Розанова Вера Платоновна",
    "Романова Маргарита Степановна",
    "Русакова Виктория Егоровна",
    "Русакова Ульяна Егоровна",
    "Рябова Анастасия Николаевна",
    "Савельева Ева Матвеевна",
    "Сазонова Ева Ивановна",
    "Сальникова Анастасия Артёмовна",
    "Самсонова Мария Ивановна",
    "Селезнева Виктория Макаровна",
    "Селиванова Екатерина Игоревна",
    "Семенова Василиса Георгиевна",
    "Семенова Виктория Марковна",
    "Семенова Ульяна Александровна",
    "Сергеева Елизавета Егоровна",
    "Сергеева Евгения Платоновна",
    "Сизова Анастасия Ивановна",
    "Смирнова Ева Кирилловна",
    "Смирнова Ксения Григорьевна",
    "Соколова Мария Никитична",
    "Соколова Полина Игоревна",
    "Сомова Варвара Дмитриевна",
    "Степанова Татьяна Артёмовна",
    "Степанова София Кирилловна",
    "Суханова Юлия Егоровна",
    "Тарасова Ева Данииловна",
    "Терентьева София Артёмовна",
    "Тимофеева Арина Артёмовна",
    "Титова Алиса Михайловна",
    "Третьякова Александра Петровна",
    "Успенская Евгения Михайловна",
    "Устинова Полина Михайловна",
    "Устинова Василиса Ивановна",
    "Федосеева Евгения Георгиевна",
    "Федотова Кристина Егоровна",
    "Федотова Светлана Андреевна",
    "Филиппова Анна Денисовна",
    "Филиппова Светлана Михайловна",
    "Филиппова Полина Александровна",
    "Фокина София Андреевна",
    "Фролова Дарья Ильинична",
    "Харитонова Анастасия Ивановна",
    "Хромова Елизавета Мироновна",
    "Чернышева Анна Антоновна",
    "Чернышева Елизавета Леонидовна",
    "Чернышева Кира Руслановна",
    "Шилова Валерия Александровна",
    "Широкова Полина Александровна",
    "Щеглова София Данииловна",
    "Щербакова Зоя Павловна",
    "Яковлева Дарья Львовна",
    "Яковлева Мария Серафимовна",
    "Алексеев Максим Елисеевич",
    "Андреев Константин Викторович",
    "Андрианов Владимир Лукич",
    "Анисимов Николай Егорович",
    "Балашов Василий Константинович",
    "Белов Макар Михайлович",
    "Белоусов Илья Максимович",
    "Белоусов Михаил Даниилович",
    "Беляев Тимур Степанович",
    "Богомолов Роман Егорович",
    "Борисов Максим Артёмович",
    "Бородин Захар Николаевич",
    "Вдовин Ярослав Лукич",
    "Волков Павел Даниилович",
    "Гаврилов Николай Даниилович",
    "Гаврилов Сергей Александрович",
    "Герасимов Филипп Тимофеевич",
    "Голубев Ярослав Дмитриевич",
    "Горбунов Владимир Максимович",
    "Горюнов Михаил Михайлович",
    "Давыдов Георгий Алексеевич",
    "Данилов Алексей Артёмович",
    "Дроздов Андрей Георгиевич",
    "Ефремов Артём Платонович",
    "Жданов Егор Владимирович",
    "Зайцев Илья Фёдорович",
    "Золотарев Даниил Артёмович",
    "Зыков Артём Викторович",
    "Иванов Михаил Дмитриевич",
    "Иванов Максим Матвеевич",
    "Ильин Егор Матвеевич",
    "Ильин Святослав Тимофеевич",
    "Казаков Александр Александрович",
    "Калинин Артемий Вадимович",
    "Карасев Владислав Павлович",
    "Карпов Александр Матвеевич",
    "Комаров Лев Тимофеевич",
    "Кондратьев Павел Григорьевич",
    "Кононов Георгий Михайлович",
    "Корнилов Пётр Даниилович",
    "Королев Андрей Даниилович",
    "Королев Фёдор Иванович",
    "Кочетов Артём Викторович",
    "Кузнецов Максим Фёдорович",
    "Кузнецов Иван Михайлович",
    "Лавров Леонид Алексеевич",
    "Ларионов Лев Артёмович",
    "Латышев Тихон Матвеевич",
    "Лебедев Герман Фёдорович",
    "Макаров Максим Михайлович",
    "Максимов Арсений Александрович",
    "Малахов Иван Ильич",
    "Михайлов Николай Иванович",
    "Михайлов Максим Кириллович",
    "Морозов Иван Богданович",
    "Наумов Иван Тимофеевич",
    "Нестеров Демид Тимофеевич",
    "Николаев Владимир Вадимович",
    "Николаев Демид Дмитриевич",
    "Носов Алексей Николаевич",
    "Орлов Владислав Адамович",
    "Осипов Владимир Сергеевич",
    "Павлов Владимир Степанович",
    "Панов Артём Артёмович",
    "Петров Тимофей Антонович",
    "Петров Максим Андреевич",
    "Петухов Даниил Тимурович",
    "Пирогов Дмитрий Захарович",
    "Попов Константин Георгиевич",
    "Прокофьев Андрей Маркович",
    "Романов Кирилл Владиславович",
    "Романов Григорий Миронович",
    "Русанов Лев Макарович",
    "Самойлов Марк Иванович",
    "Сафонов Максим Егорович",
    "Семенов Лев Юрьевич",
    "Сергеев Арсений Тимурович",
    "Серов Тимофей Игоревич",
    "Смирнов Матвей Фёдорович",
    "Смирнов Александр Максимович",
    "Соколов Евгений Даниилович",
    "Сорокин Ярослав Дмитриевич",
    "Сорокин Владимир Никитич",
    "Софронов Тимофей Владимирович",
    "Степанов Владислав Иванович",
    "Субботин Кирилл Тимурович",
    "Сурков Дмитрий Ярославович",
    "Титов Ярослав Адамович",
    "Уваров Ярослав Никитич",
    "Федоров Фёдор Даниилович",
    "Филатов Тимофей Николаевич",
    "Фокин Роман Матвеевич",
    "Фролов Дмитрий Родионович",
    "Чернышев Антон Михайлович",
    "Шилов Никита Васильевич",
    "Шилов Михаил Николаевич",
    "Широков Роберт Львович",
    "Шубин Дмитрий Адамович",
    "Шубин Артём Матвеевич",
    "Яковлев Илья Максимович",
]
